9028381/msp/empty.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default" --product "mspm0_sdk@2.01.00.03"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121        = ADC12.addInstance();
const Board         = scripting.addModule("/ti/driverlib/Board");
const DMA           = scripting.addModule("/ti/driverlib/DMA");
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const GPIO6         = GPIO.addInstance();
const GPIO7         = GPIO.addInstance();
const GPIO8         = GPIO.addInstance();
const GPIO9         = GPIO.addInstance();
const GPIO10        = GPIO.addInstance();
const GPIO11        = GPIO.addInstance();
const I2C           = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1          = I2C.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const PWM2          = PWM.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const TIMER         = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1        = TIMER.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const UART2         = UART.addInstance();
const UART3         = UART.addInstance();
const UART4         = UART.addInstance();
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
const divider3       = system.clockTree["MDIV"];
divider3.divideValue = 10;
scripting.suppress("MDIV will be disabled \\(/1\\) when sourced from anything other than SYSOSC with frequencyValue 4MHz", divider3, "divideValue");

const divider4       = system.clockTree["PLL_CLK0_DIV"];
divider4.divideValue = 4;

const divider7       = system.clockTree["PLL_PDIV"];
divider7.divideValue = 2;

const divider9       = system.clockTree["UDIV"];
divider9.divideValue = 2;

const multiplier2         = system.clockTree["PLL_QDIV"];
multiplier2.multiplyValue = 5;

const mux8       = system.clockTree["HSCLKMUX"];
mux8.inputSelect = "HSCLKMUX_SYSPLL2X";

const mux9       = system.clockTree["LFXTMUX"];
mux9.inputSelect = "LFXTMUX_TRUE";

const pinFunction3     = system.clockTree["HFCLKEXT"];
pinFunction3.enable    = true;
pinFunction3.inputFreq = 8;

ADC121.$name               = "ADC12_0";
ADC121.sampClkSrc          = "DL_ADC12_CLOCK_ULPCLK";
ADC121.adcMem0chansel      = "DL_ADC12_INPUT_CHAN_3";
ADC121.enabledInterrupts   = ["DL_ADC12_INTERRUPT_MEM0_RESULT_LOADED"];
ADC121.powerDownMode       = "DL_ADC12_POWER_DOWN_MODE_MANUAL";
ADC121.adcPin3Config.$name = "ti_driverlib_gpio_GPIOPinGeneric4";

Board.InitPriority8               = "/ti/driverlib/PWM";
Board.genPeriphPinFile            = true;
Board.peripheral.$assign          = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";
Board.genFileMod.$name            = "ti_driverlib_BoardPins0";

GPIO1.$name                               = "M1";
GPIO1.associatedPins.create(4);
GPIO1.associatedPins[0].$name             = "M1_D1";
GPIO1.associatedPins[0].pin.$assign       = "PB4";
GPIO1.associatedPins[1].$name             = "M1_D2";
GPIO1.associatedPins[1].pin.$assign       = "PB5";
GPIO1.associatedPins[2].$name             = "M1_CH1";
GPIO1.associatedPins[2].direction         = "INPUT";
GPIO1.associatedPins[2].interruptEn       = true;
GPIO1.associatedPins[2].interruptPriority = "0";
GPIO1.associatedPins[2].polarity          = "RISE";
GPIO1.associatedPins[2].pin.$assign       = "PA9";
GPIO1.associatedPins[3].$name             = "M1_CH2";
GPIO1.associatedPins[3].direction         = "INPUT";
GPIO1.associatedPins[3].pin.$assign       = "PA8";

GPIO2.$name                               = "M2";
GPIO2.associatedPins.create(4);
GPIO2.associatedPins[0].$name             = "M2_D1";
GPIO2.associatedPins[0].pin.$assign       = "PA7";
GPIO2.associatedPins[1].$name             = "M2_D2";
GPIO2.associatedPins[1].pin.$assign       = "PB2";
GPIO2.associatedPins[2].$name             = "M2_CH1";
GPIO2.associatedPins[2].direction         = "INPUT";
GPIO2.associatedPins[2].interruptEn       = true;
GPIO2.associatedPins[2].interruptPriority = "0";
GPIO2.associatedPins[2].polarity          = "RISE";
GPIO2.associatedPins[2].pin.$assign       = "PB0";
GPIO2.associatedPins[3].$name             = "M2_CH2";
GPIO2.associatedPins[3].direction         = "INPUT";
GPIO2.associatedPins[3].pin.$assign       = "PB1";

GPIO3.$name                               = "M3";
GPIO3.associatedPins.create(4);
GPIO3.associatedPins[0].$name             = "M3_D1";
GPIO3.associatedPins[0].pin.$assign       = "PA12";
GPIO3.associatedPins[1].$name             = "M3_D2";
GPIO3.associatedPins[1].pin.$assign       = "PB15";
GPIO3.associatedPins[2].$name             = "M3_CH1";
GPIO3.associatedPins[2].direction         = "INPUT";
GPIO3.associatedPins[2].interruptEn       = true;
GPIO3.associatedPins[2].interruptPriority = "0";
GPIO3.associatedPins[2].polarity          = "RISE";
GPIO3.associatedPins[2].pin.$assign       = "PB16";
GPIO3.associatedPins[3].$name             = "M3_CH2";
GPIO3.associatedPins[3].direction         = "INPUT";
GPIO3.associatedPins[3].pin.$assign       = "PB14";

GPIO4.$name                               = "M4";
GPIO4.associatedPins.create(4);
GPIO4.associatedPins[0].$name             = "M4_D1";
GPIO4.associatedPins[0].pin.$assign       = "PB11";
GPIO4.associatedPins[1].$name             = "M4_D2";
GPIO4.associatedPins[1].pin.$assign       = "PB10";
GPIO4.associatedPins[2].$name             = "M4_CH1";
GPIO4.associatedPins[2].direction         = "INPUT";
GPIO4.associatedPins[2].interruptEn       = true;
GPIO4.associatedPins[2].interruptPriority = "0";
GPIO4.associatedPins[2].polarity          = "RISE";
GPIO4.associatedPins[2].pin.$assign       = "PB7";
GPIO4.associatedPins[3].$name             = "M4_CH2";
GPIO4.associatedPins[3].direction         = "INPUT";
GPIO4.associatedPins[3].pin.$assign       = "PB6";

