9028381/msp/empty.syscfg
UART4.enabledDMATXTriggers             = "DL_UART_DMA_INTERRUPT_TX";
UART4.enabledInterrupts                = ["RX"];
UART4.targetBaudRate                   = 460800;
UART4.interruptPriority                = "2";
UART4.txFifoThreshold                  = "DL_UART_TX_FIFO_LEVEL_3_4_EMPTY";
UART4.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_3_4_FULL";
UART4.$name                            = "UART_4";
UART4.peripheral.$assign               = "UART1";
UART4.peripheral.rxPin.$assign         = "PA18";
UART4.peripheral.txPin.$assign         = "PA17";
UART4.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART4.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric2_COPY_COPY";
UART4.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric3_COPY_COPY";
UART4.DMA_CHANNEL_TX.addressMode       = "b2f";
UART4.DMA_CHANNEL_TX.srcLength         = "BYTE";
UART4.DMA_CHANNEL_TX.dstLength         = "BYTE";
UART4.DMA_CHANNEL_TX.$name             = "DMA_CH4";

ProjectConfig.deviceSpin = "MSPM0G3507";
scripting.suppress("Migrating requires going through the Switch Board or Device menu in the Device View section\\.", ProjectConfig, "deviceSpin");

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
pinFunction3.peripheral.$suggestSolution            = "SYSCTL";
pinFunction3.peripheral.hfclkInPin.$suggestSolution = "PA6";
ADC121.peripheral.$suggestSolution                  = "ADC0";
ADC121.peripheral.adcPin3.$suggestSolution          = "PA24";
GPIO5.associatedPins[0].pin.$suggestSolution        = "PA0";
GPIO6.associatedPins[0].pin.$suggestSolution        = "PB22";
GPIO6.associatedPins[1].pin.$suggestSolution        = "PB24";
GPIO10.associatedPins[0].pin.$suggestSolution       = "PB25";
GPIO10.associatedPins[1].pin.$suggestSolution       = "PB23";
GPIO11.associatedPins[0].pin.$suggestSolution       = "PB21";
GPIO11.associatedPins[1].pin.$suggestSolution       = "PA23";
I2C1.peripheral.sdaPin.$suggestSolution             = "PA16";
PWM2.peripheral.$suggestSolution                    = "TIMG6";
PWM2.peripheral.ccp0Pin.$suggestSolution            = "PA29";
UART1.peripheral.$suggestSolution                   = "UART2";
UART1.DMA_CHANNEL_TX.peripheral.$suggestSolution    = "DMA_CH3";
UART2.DMA_CHANNEL_TX.peripheral.$suggestSolution    = "DMA_CH2";
UART3.DMA_CHANNEL_TX.peripheral.$suggestSolution    = "DMA_CH1";
UART4.DMA_CHANNEL_TX.peripheral.$suggestSolution    = "DMA_CH0";
